{"content": "You’re twenty-eight, maybe thirty-two, and the question arrives like scheduled weather. When are you getting married? The inquiry carries no malice, only the weight of inevitability—like asking when you’ll learn to drive or finish your degree. Marriage sits in the architecture of a life well-lived, a milestone on a map everyone seems to be reading from. You feel it in the silences at family dinners, in the algorithmic suggestions of dating apps, in the particular loneliness of Sunday mornings. The pressure doesn’t announce itself as pressure. It masquerades as care, as common sense, as the natural order of things.\n\nBut pause here. Notice something.\n\nThe reasons we move toward marriage—the invisible infrastructure of motivation beneath the conscious choice—are rarely examined. They operate like water to a fish, so thoroughly pervasive that they become invisible. We marry because everyone does. Because she’s beautiful. Because he makes you laugh and you’re tired of being alone. Because your friends are doing it. Because there’s a void that needs filling and surely another person can fill it. Because the Instagram feed of solitary life after forty looks suspiciously empty of joy.\n\nThese reasons feel sufficient. They feel like enough. And here is where the investigation must begin—because what we don’t examine, we inevitably suffer.\n\nThe Conditioning Runs Deeper Than We Know\n\nWalk backward through the logic. Why does marriage feel inevitable? Trace the thread and you find yourself in childhood, absorbing narrative like air. Every Disney movie ended with a wedding. Every romance novel, every family sitcom, every cultural story you consumed taught you that love finds its completion in marriage, that being chosen by another person is the ultimate validation, that partnership is the solution to the fundamental problem of being human. You learned this before you learned algebra. Before you understood what loneliness actually was, you were taught to fear it—and told that marriage was the cure.\n\nThe conditioning is elegant in its efficiency. It doesn’t need to convince you with arguments. It simply arranges the furniture of your imagination so that one path appears lit and all others fade into shadow. Marriage becomes the default setting, the assumed destination, the threshold between provisional life and real life.\n\nConsider beauty. We’re drawn to beautiful people—this much is biology, the evolutionary script written in our reward circuits. But notice how quickly beauty becomes justification. She’s so attractive, I’d be lucky to marry her. As if beauty were evidence of compatibility, as if the arrangement of someone’s features predicted anything about their capacity for patience when you’re sick, or stubborn, or afraid. We confuse aesthetic pleasure with existential fit. We imagine that the dopamine rush of attraction is the same thing as sustainable love.\n\nThe reasoning sounds almost reasonable: I’m attracted to them, therefore I should commit my life to them. But desire is not wisdom. Wanting is not knowing. Beauty offers a kind of promise—the promise that life with this person will feel as good as looking at them feels now. It’s a contract written in sensation, not reality.\n\nAnd then there’s the void. You know the one. The particular ache of Friday nights alone, of waking up in an empty bed, of having no one to call when something good or terrible happens. That void feels like a problem requiring a solution. It feels like evidence of incompleteness, like a deficit that needs correcting. And everywhere you look, the culture confirms this diagnosis: you’re lonely because you’re single, and you’re single because you haven’t found the right person yet.\n\nSo you search. And when you find someone who seems to fit, who makes the loneliness recede, you mistake relief for rightness. You think: This is it. This is what I was missing. The void quiets, and in that quieting you hear the whisper of forever.\n\nBut the void exists whether you’re alone or partnered. It’s not a problem of circumstance but of consciousness. It’s the human condition arriving as feeling—the basic fact of being separate, aware, temporary. Another person can distract you from it, can build elaborate scaffolding around it, but they cannot eliminate it. When we marry to escape loneliness, we bring that loneliness into the marriage. And when it inevitably resurfaces—because it will, because it must—we blame our partner for not being enough, for failing to complete us the way the narrative promised they would.\n\nThe Social Pressure Operates Like Gravity\n\nThen there’s the accumulated weight of other people’s expectations. Your parents want grandchildren. Your friends are all pairing off, and suddenly the group dynamics shift—couples here, you there, the odd number that makes restaurant reservations complicated. You’re thirty-five and someone jokes about your biological clock, and even though you laugh, something tightens in your chest. The pressure doesn’t arrive as command. It arrives as concern, as normalcy, as the reasonable question: Don’t you want someone to share your life with?\n\nWhat makes this pressure so effective is that it’s both external and internalized. You’ve absorbed it so thoroughly that it now speaks in your own voice. You’re the one feeling anxious at weddings. You’re the one scrolling through dating apps at midnight, wondering what’s wrong with you. The social script has become your private thoughts, and you can’t tell the difference between what you genuinely want and what you’ve been taught to want.\n\nThe Invisible Alternative: Where Are the Happy Unmarried Elders?\n\nAnd consider this: where are the models of happy, older, unmarried people? Not the bitter divorcées, not the tragic spinsters of cultural mythology, but actual people in their fifties and sixties and seventies living rich, connected, meaningful lives without a partner.\n\nHere’s an experiment in attention. Close your eyes and try to conjure an image of a happy, unmarried seventy-year-old. Not someone who’s been divorced and carries the wound of it. Not someone marked by bitterness or resignation or the tragedy of being “left behind.” Just someone genuinely content—someone whose face shows the deep lines of laughter rather than longing, whose life is full not despite the absence of a partner but in ways that make partnership irrelevant to the question of fulfillment.\n\nCan you see them? Most people can’t. Not because such people don’t exist, but because the cultural imagination has no space for them.\n\nWe have archetypal slots for unmarried old age, but they’re all variations of lack. The spinster. The bachelor. The widow or widower defined by loss. The eccentric aunt. The confirmed bachelor with his “roommate.” Each archetype carries either pity or suspicion—the unspoken question being what went wrong? What prevented them from achieving the coupled state we’ve decided is the measure of a life well-lived?\n\nThis absence of positive models does something profound to our decision-making. It forecloses possibility before we even know we’re choosing. When you cannot imagine a good outcome for unmarried life, when every story you’ve absorbed ends either with partnership or tragedy, the choice stops being a choice. It becomes a foregone conclusion. Marriage or failure. Partnership or emptiness. The binary hardens into inevitability.\n\nWhat this does to thirty-five-year-olds scrolling through dating apps at midnight, feeling the particular desperation of a deadline approaching. They’re not just looking for love—they’re trying to avoid a future they’ve never seen modeled as anything but cautionary. They’re running from an imagined lonely apartment, an imagined absence of phone calls, an imagined Thanksgiving table set for one. The terror isn’t about what they’ll lose by not marrying. It’s about becoming invisible, becoming the person whose life makes others uncomfortable, whose singleness requires explanation.\n\nBut unmarried elders do exist, and some of them have discovered something the coupled world struggles to access. They’ve learned to build meaning from sources other than romantic partnership. They’ve cultivated friendships with the depth and commitment usually reserved for spouses. They’ve created lives where solitude isn’t loneliness but spaciousness, where independence isn’t isolation but freedom, where the absence of a partner leaves room for other forms of connection that partnered people often let atrophy.\n\nI know a woman, sixty-eight, who never married. She teaches literature at a community college, tends an absurd garden, hosts dinner parties where the conversation runs until midnight, travels for months at a time with friends or solo, and radiates a kind of contentment that’s difficult to name because we have so few words for satisfaction that doesn’t come from romantic love. She’s not lonely. She’s not bitter. She hasn’t “settled” for this life—she’s built it deliberately, with the same care a married person might build their marriage.\n\nBut she’s nearly invisible in the cultural narrative. When she appears in conversations about life choices, she’s always positioned as the exception, the outlier, proof of nothing except her own particular resilience. The possibility that her life might be replicable, that her contentment might be accessible to others—this idea finds no purchase in a culture that has decided marriage is the only path to meaningful old age.\n\nAnd so the alternative remains obscured. Young people grow up seeing only one illuminated path, flanked by darkness on either side. They don’t know that the darkness contains other trails, other destinations, other ways of growing old that don’t require a partner to bear witness. They marry partially out of fear—not fear of being alone, but fear of becoming the cautionary tale, the person whose life didn’t “work out,” even if their actual lived experience might be rich and full and completely sufficient.\n\nThe absence of visible, happy unmarried elders functions as a form of social control. It ensures that marriage remains the default by making the alternative unimaginable. And even when unmarried elders are happy, even when their lives overflow with connection and meaning, the culture finds ways to discount or minimize their experience. “It works for them, but I couldn’t do it.” “They’re just built differently.” “Deep down, don’t you think they wish they’d found someone?”\n\nWe cannot let their contentment stand as evidence because if it did, it would destabilize everything. It would mean marriage is optional. It would mean wholeness doesn’t require another person. It would mean that the pressure we feel, the urgency to find someone before time runs out, might be manufactured rather than natural. And if that’s true—if the desperation is invented—then what else might we be getting wrong about how to build a meaningful life?\n\nThis is not an argument against marriage. It’s an argument for clarity. For seeing the full landscape rather than the single illuminated path. For recognizing that the absence of visible alternatives shapes our choices more than we realize, and that genuine choice requires the ability to imagine multiple good outcomes.\n\nWhat would change if we had more models of joyful unmarried old age? What would shift in our decision-making if we saw, regularly and unremarkably, people in their sixties and seventies and eighties whose lives were full precisely because they’d invested their energy elsewhere—into friendships, community, creative work, solitude as practice rather than curse? We might marry less urgently. We might wait for the right reasons rather than rushing to avoid the wrong future. We might, crucially, stop treating marriage as the solution to a problem that may not exist.\n\nSo we marry because we cannot imagine not marrying. We marry because the alternative looks like failure, like settling, like giving up. We marry because we lack the imagination—or the courage—to trust that wholeness might be possible without the addition of another person.\n\nWhen Insufficient Reasons Meet Permanent Commitment\n\nit doesn’t hold.\n\nYou marry someone beautiful and discover that beauty is a terrible predictor of compatibility. The person you found so attractive still looks the same, but now you’re negotiating who does the dishes, who’s responsible for birthday cards, how money gets spent, whose career takes priority. The beauty remains, but it cannot resolve the thousand tiny frictions of shared life. It cannot teach you how to fight fairly, or apologize, or sit with discomfort without retreating. And slowly, imperceptibly, you start to feel deceived—not by your partner, but by the promise that beauty implied.\n\nYou marry to escape loneliness and discover that loneliness has many rooms. You can be lonely in a marriage—perhaps more acutely lonely because now the person right next to you still cannot reach the place inside you that aches. The void you brought with you remains. And worse: now you’ve promised forever to someone, which means this is supposed to be enough. If you’re still lonely, it must mean something is wrong with the marriage, wrong with your partner, wrong with you. The shame of it sits heavy in the space between you.\n\nYou marry because everyone else is doing it and discover that other people’s timelines have nothing to do with your readiness. You rushed because you felt behind. You said yes because the pressure was easier to yield to than resist. But marriage demands a thousand small yeses—daily choices to show up, to be patient, to try again. And if the initial yes wasn’t rooted in genuine commitment, if it was more about external validation than internal conviction, those thousand small yeses become obligations. Resentment grows in the gap between what you agreed to and what you actually wanted.\n\nThe marriage becomes unhappy not because either person is wrong, but because the foundation was never designed to bear the weight of actual partnership. You were solving the wrong problem. You were answering a question nobody asked: What will make me acceptable? What will relieve this discomfort? What will prove I’m normal?\n\nYou were not asking: Who can I become old with? Who will I want to take care of when they can’t take care of themselves? Whose decline can I witness with tenderness? Who will hold my hand when I’m dying?\n\nWhat Marriage Actually Is\n\nStrip away the Instagram aesthetics, the wedding-industrial complex, the romantic comedy endings, and marriage reveals itself as something far stranger and more demanding than we imagined. Marriage is not the reward for finding the right person. It is not a solution to loneliness or a validation of worth. It is not—and this is crucial—about how someone makes you feel in this moment.\n\nMarriage is about time. Long time. Uncomfortable, unglamorous, humbling time.\n\nMarriage is about changing each other’s diapers when you’re old. Not metaphorically—literally. It’s about waking up next to someone whose body has failed them, whose mind may not recognize you some days, whose dignity requires your hands. It’s about being willing to see someone at their most reduced, most vulnerable, most dependent—and choosing, again and again, to show up with tenderness.\n\nThis is the long medicine. This is what the vow actually promises: not permanent happiness, but permanent presence. Not the guarantee that you’ll always like each other, but the commitment that you’ll stay anyway. Not the fantasy that you’ve found your missing piece, but the reality that you’ve chosen someone to weather time with—and time breaks everything, eventually.\n\nWhen you marry, you’re not just committing to the person in front of you. You’re committing to who they’ll become in twenty, forty, sixty years. You’re committing to their illness, their failure, their depression, their disappointment. You’re committing to watching them lose things—beauty, certainty, independence—and loving them through the loss.\n\nYou’re saying: I’ll be there when you can’t remember where you put your keys. I’ll be there when you can’t walk without help. I’ll be there when you’re afraid of dying. I’ll be there when you’re actually dying. And I won’t just be there—I’ll want to be there. Your diminishment won’t diminish my commitment.\n\nThis is what makes marriage terrifying. Not the wedding, not the decision itself, but the full understanding of what you’re agreeing to. You’re agreeing to witness someone’s entire arc—the rising and the falling, the accumulation and the losing, the expansion and the inevitable contraction. You’re agreeing to be the one who stays when staying is hard, when the person you married has changed so much they barely resemble who you thought you knew.\n\nAnd they’re agreeing to the same for you.\n\nThe Question Underneath the Question\n\nSo when someone asks, “Why do people marry?” the honest answer might be: Because they don’t know what they’re agreeing to.\n\nThey marry for beauty, which fades. For completion, which is impossible. For escape, which doesn’t work. For social validation, which provides no shelter when the relationship gets hard. They marry because it seems like the next thing to do, the expected thing, the safe thing. They marry because they cannot imagine an alternative, or because the alternative frightens them more than the commitment.\n\nAnd then they suffer—not because marriage itself is the problem, but because the reasons they entered it were never sufficient to sustain it. The contract was signed under false pretenses: I thought this would make me happy. I thought this would fix my loneliness. I thought this would prove something about my worth.\n\nBut marriage proves nothing. It fixes nothing. It makes you nothing except married.\n\nWhat it does offer—if you’re lucky, if you’re willing, if you entered it with your eyes open—is the strange gift of deep time with another person. The gift of being known not just in your best self but in your worst. The gift of having someone who remembers what you were like before life got hard, and who’ll still be there when life gets harder. The gift of love that isn’t about feeling but about action, not about attraction but about commitment, not about what you gain but about what you’re willing to give when giving requires everything.\n\nRediscovering What’s Sufficient\n\nHere’s the paradox: the best reason to marry might be to have examined all the insufficient reasons first.\n\nTo have sat with your loneliness long enough that you’re no longer afraid of it, no longer desperate for someone else to fix it. To have watched attraction rise and fall enough times that you know it’s not a reason for anything except attention. To have felt the social pressure and chosen—consciously, deliberately—whether to yield to it or not. To have looked at the cultural script and asked: Is this mine? Or is this just the story I inherited?\n\nWhen you’ve done that work—the work of becoming whole enough to not need another person to complete you—then you can ask the real question: Despite not needing them, do I want them? Do I want specifically this person, not for what they solve but for who they are? Am I willing to choose them not just today but through all their todays, including the ones where they’re difficult, or sick, or changed beyond recognition?\n\nThat’s the investigation that precedes genuine commitment. Not “Does this person make me happy?” but “Am I willing to be there when happiness isn’t the point anymore? When duty, care, and simple human decency become the only reasons to stay—am I prepared to find those reasons sufficient?”\n\nThe Mirror You’re Not Ready to Face\n\nBut even if we clear the conditioning, even if we recognize the insufficient reasons and wait for better ones, even if we can imagine happiness outside of marriage—there’s still the question of readiness. And here’s where the real work begins, the work most people skip entirely on their way to the altar.\n\nYou cannot love another person until you have learned to love yourself completely. Not the easy parts—not the charming self-presentation, not the accomplishments, not the traits that earn approval. All of it. The shadow parts, the shameful parts, the aspects of yourself you’ve spent years trying to hide or fix or deny. Until you can hold every part of yourself with acceptance, you will use your partner as a screen onto which you project everything you cannot face in yourself.\n\nThis isn’t metaphor. It’s mechanism. Here’s how it works.\n\nYou carry within you aspects of yourself that you’ve disowned—the anger you were taught wasn’t acceptable, the neediness you learned to call weakness, the selfishness you’ve labeled as wrong, the sadness you’ve been trained to push away. These parts don’t disappear when you deny them. They go underground. They wait. And then you meet someone, you fall in love, and suddenly these disowned parts appear—but not in you. In them.\n\nYour partner becomes unreasonably angry, and you’re shocked. You find them needy, clinging, too dependent. They’re selfish with their time, selfish with their attention. They’re sad for no reason, and their sadness feels like an imposition. You catalogue their flaws with increasing clarity. You start sentences with “Why can’t you just...” or “You always...” or “The problem with you is...”\n\nAnd you don’t realize—because how could you?—that you’re fighting with yourself. That everything you criticize in them is something you cannot accept in yourself. Your partner has become a mirror, reflecting back the parts of you that remain unintegrated, unaccepted, unloved. And instead of recognizing this as information about your own inner landscape, you experience it as proof of your partner’s inadequacy.\n\nThis is why marriages built on an incomplete self crumble under the weight of projection. You thought you were getting a partner. You actually got a mirror. And the mirror shows you everything you’ve been running from—which is why the relationship becomes a battlefield. You’re not fighting them. You’re fighting the reflection of your own unmet darkness.\n\nConsider how this appears in real time. You were raised to be agreeable, to never make waves, to swallow your anger and call it peace. So you did. You became the person who doesn’t get angry. You took pride in your calmness, your rationality, your measured responses. But the anger didn’t vanish—it went into your body, into your clenched jaw, into your silent resentments. You became a pressure cooker with no release valve, convinced you’d transcended anger when you’d only suppressed it.\n\nThen you marry someone who expresses anger freely. They raise their voice. They slam doors. They allow their frustration to be visible, audible, undeniable. And you recoil. You judge them. You call them volatile, unstable, too emotional. You make them wrong for the very thing you’ve made unavailable to yourself.\n\nBut what’s actually happening is that their anger is triggering your disowned anger. They’re giving expression to the very thing you’ve locked away, and instead of recognizing this as an opportunity for integration, you experience it as threat. So you criticize them. You try to change them. You make their anger into a relationship problem when it’s actually pointing toward your inner work.\n\nOr consider neediness. You learned early that needing people was dangerous—they leave, they disappoint, they’re unavailable when it matters. So you became self-sufficient. You took pride in not needing anyone. You built your identity around independence. But the need didn’t disappear—it went underground, waiting.\n\nThen your partner expresses need. They want more time with you. They ask for reassurance. They want to know you’re thinking of them. And something in you hardens. You call them clingy. You feel suffocated. You start pulling away, creating distance, protecting your independence. You make their need into evidence of weakness.\n\nBut their need is simply reflecting your own disowned need. They’re expressing what you’ve forbidden yourself to express. And instead of softening toward them, instead of seeing in their vulnerability an invitation to access your own, you reject them for showing you what you’ve rejected in yourself.\n\nThis pattern runs through every relationship where one or both people haven’t done the work of self-acceptance. The relationship becomes a stage where your unloved parts perform, except they’re wearing your partner’s face. You think you’re dealing with their issues, their problems, their inadequacies. You’re actually dealing with your own projected shadow.\n\nAnd your partner can sense it. They can feel that they’re being seen as someone they’re not, that you’re relating to your projection rather than to them as they actually are. They try to explain that they’re not as needy as you claim, not as angry, not as selfish—but you can’t hear it. Your projection is too strong. The mirror is too convincing.\n\nThe marriage becomes a hall of mirrors, each person reflecting the other’s disowned parts, neither person seeing clearly. Both feel misunderstood, both feel criticized for being themselves, both start to wonder if they made a mistake. And they might have—not in choosing each other, but in choosing partnership before completing the necessary work of self-integration.\n\nThe path to loving another begins with the uncomfortable work of loving yourself—all of yourself. This means sitting with the parts you’ve labeled as unacceptable and asking: What if these parts are not flaws but data? What if my anger is information? What if my need is human? What if my selfishness is just the voice of unmet desires that deserve attention?\n\nIt means recognizing that you are not only your light. You are also your shadow. You contain multitudes—including the messy, socially unacceptable, deeply human aspects that you’ve spent your life trying to transcend or hide. And until you can hold all of this with compassion, until you can say “I am this too, and it’s okay,” you will keep encountering it in your partner and calling it their problem.\n\nThis is the work that precedes sustainable partnership. Not the work of finding the right person, but the work of becoming a person who’s ready—ready to see another clearly because you’ve learned to see yourself clearly, ready to accept another fully because you’ve practiced accepting yourself, ready to love without projection because you’ve already done the hard work of loving your own unloved parts.\n\nWhen you’ve done this work, something shifts. Your partner’s anger stops feeling like an attack and starts feeling like information about their experience. Their need stops feeling like a burden and starts feeling like trust. Their selfishness stops feeling like evidence of their inadequacy and starts feeling like a boundary that deserves respect. You can see them as they are rather than as a screen for your projections.\n\nAnd perhaps more importantly: you can let them see you. All of you. Because you’re no longer hiding parts of yourself in shame. You’re no longer performing an acceptable version of yourself while keeping the messier truth locked away. You’ve integrated enough of your shadow that you can show up whole—imperfect, sometimes difficult, sometimes needy or angry or selfish, but whole.\n\nThis is what makes love possible. Not the romantic kind, not the infatuation that ignites at first sight, but the durable kind—the kind that can hold conflict without fracture, the kind that can witness another’s darkness without recoiling, the kind that says “I see you, all of you, and I choose you still.”\n\nYou cannot offer this to another until you’ve offered it to yourself first. The marriage vow to love in sickness and health, for better or worse, begins as a vow to yourself: I will love all of me. I will not exile the parts that feel unlovable. I will not make my wholeness conditional on being acceptable to others. I will meet my shadow with the same compassion I meet my light.\n\nOnly then, only after this reckoning, can you stand beside another person and mean what you’re promising. Only then can you see them clearly enough to know if this is the person you want to witness your life, if this is the person whose decline you’re willing to tend, if this is the person you’ll choose again tomorrow when choosing feels hard.\n\nWhat Remains\n\nBecause every reason to marry except the hardest ones will eventually fail you. Beauty fades. Loneliness returns. Social approval means nothing at three in the morning when you’re holding someone through their pain. The Instagram moments end. The void remains.\n\nWhat’s left is simpler and more demanding: the choice to be the person who stays. The choice to love someone not as an idea, not as a solution, not as a validation, but as a specific, flawed, changing human whose life you’ve agreed to witness—all of it, start to finish.\n\nMarriage isn’t about the wedding. It’s about the long, unglamorous afterward. It’s about becoming the kind of person who can handle that afterward with grace and patience and maybe even joy. It’s about waking up when you’re seventy-five next to someone you’ve watched become old, whose body you know better than your own, and feeling not disappointment that this is what it came to, but gratitude that you got to share the arc.\n\nIt’s about being willing to change someone’s diaper—literally, physically—and finding that somewhere in that act, in the daily unsexy reality of care, something like love remains. Not the love you started with, not the feeling that made you say yes, but something quieter and more durable: the love that shows up because it promised to. The love that keeps choosing even when choosing is a burden.\n\nThat’s what marriage actually is. That’s what it asks of us.\n\nAnd maybe the reason so many marriages fail isn’t that people chose the wrong person, but that they never understood what they were choosing. They thought they were choosing happiness, completion, solution. They were actually choosing responsibility—the responsibility to be someone’s witness, someone’s companion through the whole experiment, the beautiful parts and the brutal parts and the long, ordinary stretches in between.\n\nIf we understood that from the beginning—if we let go of the conditioning that teaches us marriage is the answer to our problems and recognized it as the beginning of a different kind of problem, a different kind of work—we might choose more carefully. We might wait longer. We might do the inner work first, the work of loving our unloved parts so we can see another clearly instead of through the fog of projection.\n\nWe might marry less often and mean it more deeply.\n\nWe might, in the end, build partnerships that can actually hold the weight of time—not because we found someone to complete us, but because we became complete enough to choose partnership from wholeness rather than lack. Complete enough to know that marriage is not the solution but the question, asked new every morning: Will I choose you again today? Will I stay when staying is difficult? Will I love you through your diminishment, through mine, through the long unwinding that is every human life?\n\nAnd if the answer is yes—if after clearing the conditioning, examining the projections, and doing the work of self-integration, the answer is still yes—then perhaps you’re ready. Not for the wedding, but for the afterward. Not for the beginning, but for the middle and the end.\n\nThat’s when marriage becomes what it was always meant to be: two whole people choosing to share the arc of a life, not because they need each other to be complete, but because they want to witness each other’s completeness through time. Because they’re willing to be the one who stays. Because they understand that love, in the end, is not about feeling but about action. Not about what you gain but about what you’re willing to give when giving requires everything.\n\nThis is the long medicine. And it only works if you’re willing to take it all."}