{"content": "Prologue: The Pattern of Suffering\n\nBy 2017, I was living in what felt like complete destruction. Not dramatic or visible from the outside, but an internal state that coloured everything. The sensations in my body felt heavy, contracted, wrong. Life itself seemed off, like trying to breathe through a wet cloth.\n\nI didn’t understand this then. There was no clarity, no sudden insight. I just felt broken in ways I couldn’t articulate. The story running underneath everything was simple: I am not enough. I am fundamentally flawed. The world will reject me if it sees who I really am.\n\nThis wasn’t a thought that appeared once and disappeared. It was the operating system beneath every other thought, every feeling, every choice I made. It was so foundational that I couldn’t see it as a story at all. It was just how things were.\n\nAt that time, I was caught in what I can only describe as a survival loop. My nervous system lived in a state of constant threat detection. Anxiety wasn’t something that happened to me occasionally, it was the baseline hum of my existence.\n\nI was addicted to alcohol, cigarettes, other substances. Not because I enjoyed them, but because they were the only reliable tools I had found to temporarily quiet the internal noise.\n\nThere was deep shame around sexuality, around intimacy, around my own body. I was a people-pleaser of the most reactive kind, contorting myself into whatever shape I thought others wanted, desperate for validation, especially from women I perceived as beautiful or important.\n\nRejection wasn’t just painful; it was confirmation of what I already believed to be true about myself. I was, in short, quintessentially what most of humanity is: trapped in a belief system so complete that the prison walls were invisible.\n\nWhat I didn’t understand then was that all of this, the anxiety, the shame, the addictions, the desperate seeking, was not evidence of something wrong with me. It was evidence of something beautifully, predictably mechanical about how consciousness works.\n\nThe beliefs I carried weren’t random. They came from somewhere. They had a shape, a logic, a history. They were born from early life conditioning, from moments when I learned (or rather, concluded) that the world was unsafe, that I was unworthy, that survival meant constant vigilance and adaptation.\n\nAnd if we understand consciousness through the lens of reincarnation, through samskaras, the deep grooves of conditioning carried across lifetimes, then these beliefs had roots even deeper than my childhood, deeper than this single life.\n\nWhat happened in 2017 was quieter, simpler. It was the beginning of an inward movement. The first faint light of watching the mind without immediately believing everything it said. I didn’t know that’s what it was at the time. That understanding only came later, after years of sitting with what arose, after countless hours of meditation and observation.\n\nBut the mechanism by which I became free from this wasn’t about fixing the broken thing. It was about seeing how the thing I thought was broken was never real to begin with. That seeing took time. Years, actually. But it began with something small in 2017.\n\nChapter One: The First Crack\n\nThe turning point wasn’t dramatic. It wasn’t a meditation retreat or a sudden mystical experience. It was quieter and much slower than that. It was the beginning of noticing.\n\nI remember walking around the theatres at my work place, sometime in 2017. The familiar anxiety was there, that electrical hum in my chest, the tightness in my shoulders, the sense that something was wrong and I needed to fix it immediately.\n\nInstead of relying on old habits like smoking or checking my phone, I chose to simply observe my anxiety. By not avoiding or distracting myself, I started to form a new relationship with these feelings, though the shift was gradual at first.\n\nI observed the experience analytically—asking what it felt like, where I sensed it in my body, and what message it carried. The process was mostly unconscious at the time, though it’s clearer in retrospect. My background studying Jiddu Krishnamurti helped me recognize what was happening.\n\nThe story it was telling was familiar: Something is wrong with you. You are failing. People are judging you. You need to be different.\n\nWhat changed was that I could see the story unfold and fade, like clouds in the sky, but I couldn’t affect it.\n\nThis distinction, between the observer and the observed, between awareness itself and the contents of awareness, became the first thread I pulled. And once I started pulling, the whole fabric began to unravel over time.\n\nWhat I began to understand, gradually and then with increasing clarity, was that the anxiety, the shame, the sense of being broken, none of these were facts about reality. They were interpretations. They were stories my mind was telling based on conditioning that ran so deep I had never questioned it. So in the subconscious that I din’t know.\n\nThe conditioning was simple enough, when I looked back: A child learns early that love is conditional. That safety comes from being “good,” from meeting others’ expectations, from anticipating what others want and providing it before they even ask. A child absorbs the unspoken messages: your body is shameful, your desires are wrong, your natural self is not acceptable.\n\nA child in a culture that values appearance, status, and external validation absorbed the message that his own worth was reflected in how others perceived him. These weren’t deliberate teachings. They were absorbed through the nervous system, through countless micro-moments of approval and withdrawal.\n\nBecause they were absorbed so early, before there was language to question them, they became invisible. They became the way the world is. But they weren’t the way the world is. They were the way this particular nervous system had learned to organize experience. And if they could be learned, they could be seen. And if they could be seen, they could be understood differently.\n\nChapter Two: The Machinery of the Self\n\nAs I continued to observe, a pattern emerged that was both humbling and liberating: Every moment of anxiety, shame, rejection, or unworthiness was preceded by a judgment. A story. An interpretation.\n\nRejection from a woman wasn’t just rejection. It was immediate translation: This proves you are unlovable. This is evidence of your fundamental brokenness. This is how it will always be.\n\nA critical comment from someone I respected wasn’t just feedback. It was: You are failing. You are exposed. You are not good enough.\n\nA moment of being alone wasn’t solitude. It was: You are isolated. You are not worthy of companionship. Something is wrong with you.\n\nIn each case, there was a raw experience, a sensation, an event, information from the world. And then, faster than I could consciously perceive, the mind was interpreting that experience through the lens of its deepest belief: I am not enough.\n\nIn every instance—whether it was an uncomfortable emotion, a physical sensation, or an interaction with another person—there was first the immediate, unfiltered experience. It might be the sting of a remark, the heaviness of solitude, or a fleeting moment of uncertainty. This was simply information coming in from the environment, neutral in itself and not yet coloured by meaning.\n\nYet, before there was any conscious awareness, the mind would step in. It would assign meaning, make judgements, and construct stories with astonishing speed, all guided by the most deeply held belief: I am not enough. This interpretation happened so swiftly and automatically that the original, raw experience was almost instantly overshadowed by the narrative. The mind, conditioned over years, filtered every sensation and event through this lens, turning each moment into further evidence of unworthiness.\n\nThis is where things get interesting, because it’s where we can see the machinery of consciousness itself. Neuroscience has a name for this: predictive coding. The brain doesn’t actually perceive reality as it is. The brain predicts what it expects to perceive, and then it uses sensory information to confirm or update those predictions.\n\nEssentially, your brain generates a version of reality and uses sensory input to adjust it. This reflects the true nature of perception.\n\nNow apply this to a nervous system that has learned, deeply and thoroughly, that the world is unsafe and that the self is unworthy. That nervous system is not perceiving the world neutrally. It is predicting rejection, criticism, abandonment. It is scanning for evidence of these threats.\n\nAnd because the brain is exquisitely good at finding what it looks for, it finds them. A neutral comment becomes criticism. A person’s busy schedule becomes personal rejection. A moment of quiet becomes loneliness. The external world seems to constantly confirm the internal belief.\n\nBut here’s the radical part: The external world is not causing the internal belief. The internal belief is shaping the perception of the external world.\n\nI was not a rejected person living in a world that rejected him. I was a person whose nervous system predicted rejection so thoroughly that it interpreted nearly every interaction through that lens. And because I was operating from that interpretation, my behaviour, my energy, my choices, they all reflected it. I was, quite literally, creating the experiences that seemed to confirm my belief.\n\nThis is where the addiction came in, the people-pleasing, the constant seeking of external validation. These weren’t character flaws. They weren’t evidence that something was fundamentally wrong with me. They were survival strategies built by a nervous system that believed it had to constantly monitor and manage the external world in order to be safe and acceptable.\n\nThe drinks and cigarettes, the weed? They were temporary relief from the constant vigilance. The people-pleasing? It was an attempt to control how others perceived me, to prevent the rejection I believed was inevitable.\n\nThe seeking of validation from beautiful women? It was an attempt to prove, to myself first, then to the world, that I was actually worthy of love. Every one of these behaviours made perfect sense. They were the rational response of an organism trying to survive in a world it perceived as fundamentally threatening. But they were also the mechanism by which the original belief perpetuated itself.\n\nIn evolutionary terms I was living like animals do, always in survival mode and defensive.\n\nChapter Three: The Reversal\n\nOver the course of many years, my inquiry evolved and took on a character that I can only describe as a form of spiritual science. I began to observe a pattern: the internal beliefs I held were not just fleeting thoughts, but the very foundation shaping how I perceived reality itself. This subjective perception, in turn, was directly influencing my behaviour—how I acted, responded, and moved through the world. The sum of these behaviours was then generating my lived experience, reinforcing the original beliefs I held about myself and the world around me.\n\nRather than consciously arriving at this understanding, I found that these insights surfaced on their own. It was as though, simply by being present and witnessing how belief influenced perception, which in turn guided behaviour and shaped experience, these realisations began to emerge naturally. The act of noticing—without force or denial, but with honest self-awareness—seemed to gently disrupt the automatic cycle, allowing genuine change to unfold organically.\n\nThe answer came through the simplest possible practice: seeing. Not meditation in the traditional sense. Not visualization or affirmation or any technique designed to force a different belief. Just the radical act of paying attention, to what was arising, to what was true, to how the machine was working.\n\nThe first layer: Every emotional reaction had a story underneath it. The anxiety had a story: Something is wrong. The shame had a story: I am bad. The rejection sensitivity had a story: I am unworthy. These stories weren’t facts. They were interpretations, neural patterns firing based on conditioning.\n\nThe second layer: These stories weren’t happening to me. They were happening in me. They were the outputs of a nervous system that had learned to organize experience in a particular way. And consciousness, the awareness that could observe this happening, was not the same as the stories themselves.\n\nThe third layer: This distinction mattered completely. Because if I was not identical to my stories, then I could observe them. And if I could observe them, I could see them for what they were: temporary phenomena, like weather patterns moving through consciousness.\n\nWhat started to happen was strange and gradual: The anxiety would arise, and I would notice it. Not judge it, not try to fix it, just notice it. And in that noticing, something would shift. The anxiety would still be there, but I wasn’t fused with it anymore. There was a space between the observer and the observed. It was still painful but with a little distance.\n\nA moment of rejection would come, and the familiar story would want to activate: See? This proves it. You are unworthy. But I could see the story arising. I could see the mind pattern trying to activate. And in that seeing, the pattern had less grip. It was like watching a recording of a fear rather than being in the fear.\n\nThis is crucial to understand: I wasn’t making the anxiety go away through force of will. I wasn’t telling myself a better story to replace the bad story. I was simply observing what was true, and in that observation, the system was naturally beginning to reorganize.\n\nBecause it begins to reveal its own nature. And its nature is not fixed. It is not a problem to be solved. It is a process that can recognize itself and, in that recognition, transform.\n\nI continued to observe. I noticed that the people-pleasing behaviour began to relax, not because I decided to stop being a people-pleaser, but because I could see that it was based on a false premise.\n\nThe premise was: If I shape myself to be what others want, they will love me and validate me and I will be safe. But I could see directly that this didn’t work. At my core, I believed I was only worthy if others approved of me—a belief that left me feeling hollow and unfulfilled, even in moments when I received praise or recognition. I could see that even when I got the external validation I was chasing, it didn’t actually touch the core belief. It was like drinking salt water to quench thirst. The thirst was internal.\n\nMore importantly, I could see that the people I was attracted to, the ones whose validation I most desperately sought, were often themselves caught in similar patterns. We were mirroring each other’s pain. And from that mirrored pain, we were creating relationships that confirmed our deepest wounds rather than healing them.\n\nThis seeing didn’t happen through judgment. It happened through simple observation. This is what is happening. This is the mechanism. This is what it produces. And once I could see it clearly, I didn’t need to force myself to do something different. The intelligence of my own nature, once it could see clearly, naturally began to move differently.\n\nThe addictions began to fall away too, but not through willpower or moral effort. They fell away because the function they were serving became transparent. The cigarettes were numbing me. The alcohol was quieting the internal noise. But the noise wasn’t the problem. The problem was believing the stories that generated the noise.\n\nAnd once I started to see those stories as stories rather than truths, the noise had less charge. And when the noise had less charge, I didn’t need to numb it anymore. This isn’t to say it was effortless or linear. There were moments of deep resistance, moments when the old patterns would surge back with tremendous power. But there was something that had shifted in the observing. And once it had shifted, I couldn’t unsee it.\n\nChapter Four: The Inner-to-Outer Revelation\n\nNow here’s where the inquiry took a turn that I can only describe as scientifically mystical: As I continued to observe my internal patterns, I began to notice something about the external world. The world seemed to be responding to my inner shifts.\n\nI don’t mean this in a magical sense. I mean it in a direct, observable, causal sense. When my internal belief was I am unworthy and will be rejected, my nervous system was in a state of defensive vigilance. My body held tension. My eyes had a certain quality of scanning, of reading threat. My voice had an edge of seeking approval. My behaviour was constantly calibrated to manage how others perceived me.\n\nPeople responded to this. They picked up on the underlying desperation. Some were repelled by it. Some took advantage of it. Many mirrored it back to me. And the interactions I had, the rejections, the betrayals, the lack of genuine connection, seemed like external proof of my internal belief. You see? The world is rejecting you. People don’t really want you. You are unworthy.\n\nHowever, these outcomes were not determined by external circumstances. Rather, my nervous system state, my behaviour, and the quality of my presence influenced interactions that accurately mirrored my internal framework.\n\nThis is where we touch the deepest point of the inner-to-outer reversal: What we call “external reality” is not something happening to us. It is something we are co-creating through our nervous system state, our beliefs, our perceptions, and our actions. The external world is not the cause. The external world is the consequence.\n\nAnd this changes everything. Because it means that to change the external world, to have better relationships, more authentic connections, genuine belonging, I don’t need to change the external world. I need to change the internal architecture that is generating it.\n\nAs I continued to observe and as this internal architecture shifted, something remarkable happened: The quality of people I attracted began to change. Not instantly, not magically. But over time, the interactions I had became different. More authentic. Less transactional.\n\nI began to find myself in the presence of people who were not mirroring my wounds but who had done some of their own work, who had some capacity for genuine connection. Situations that would have triggered my old patterns, moments where I might have experienced rejection or criticism, began to land differently in my nervous system.\n\nNot because I was forcing a positive interpretation, but because my system was no longer reading them as personal threats. And when I wasn’t reading them as personal threats, I could respond to them more intelligently.\n\nThe quality of my presence began to shift. I moved with less anxiety, less seeking, less defensive posturing. And people responded to that. They became more open, more genuine, more willing to meet me as a real person rather than as someone performing a role.\n\nA significant shift in perspective occurred: Previously, I assumed that my internal experiences were dictated by external circumstances, leading me to pursue validation from others, seek ideal relationships, or strive for outward achievements to enhance my well-being. However, upon closer examination, I realized that my internal framework was actually shaping my perception of external events. Consequently, I concluded that meaningful change must originate within.\n\nThis is the deepest truth of the inner-to-outer reversal: You are not trying to change the world. You are allowing yourself to see and shift the lens through which you perceive and generate the world. And the world, in response, looks completely different.\n\nChapter Five: The Mechanism of Belief\n\nAs I continued to observe, the question that naturally arose was: Where do these beliefs come from? And the answer I found was as simple as it was profound: They come from experience filtered through a particular lens.\n\nA child has an experience. Someone important withdraws approval. A moment of vulnerability is met with shame or criticism. A natural desire is labelled as wrong or bad. These are not unusual experiences. Almost every human being has versions of these.\n\nBut what happens next is crucial: The mind, in its attempt to protect itself, interprets the experience not as a moment that happened but as a truth about the self. I was rejected becomes I am rejectable. I made a mistake becomes I am a failure. Someone was angry at me becomes I am not safe. I felt lonely becomes I am alone.\n\nThese interpretations accumulate. They create what we might call a belief system, a coherent narrative about the self and the world. And once a belief system solidifies, it becomes self-perpetuating. Because the nervous system, through the mechanism of predictive coding, begins to arrange perception in such a way that the belief is constantly confirmed.\n\nWhat I’ve noticed is that these beliefs aren’t facts; they’re made up. They’re stories shaped over time into what seems real, but at their core, they remain stories. Every story has an author—not an outside one, but consciousness itself. It’s our mind’s way of interpreting experiences, helping us survive, and guiding us through a world it has come to see as threatening.\n\nNow, if we bring in the understanding of samskaras, the deep conditioning patterns that exist not just in this lifetime but across lifetimes, the picture becomes even more intricate. A samskara is a groove, a tendency, a pattern that has been carved so deep by repetition across time that it arises nearly automatically.\n\nIf we carry samskaras of unworthiness, of fundamental brokenness, of being separate and alone, patterns that may have roots in past lives, then in this lifetime, those samskaras will activate and organize our experience accordingly.\n\nA child is not placed randomly into a family; rather, their nervous system comes with patterns that fit the environment and conditioning of that family. This isn’t about assigning blame—parents don’t intentionally hurt their children. Instead, they act based on their own experiences, nervous system responses, and beliefs. Ultimately, parents do the best they can with what they know.\n\nBut the resonance happens. The conditioning gets reinforced. The samskara deepens. And if you trace back the genealogy of your own suffering, you might find that it has roots in multiple places: in the specific wounds of your parents and their parents, in the cultural conditioning you absorbed, in the historical moment you were born into, and if you’re willing to go there, in the patterns you brought with you from previous iterations of consciousness.\n\nBut Understanding the origin of the belief doesn’t change the belief. Knowing that my unworthiness came from my mother’s absence or my father’s critical eye or some past-life trauma doesn’t actually dissolve the belief.\n\nWhat dissolves the belief is seeing it directly. Seeing it not as truth, but as a construction. Seeing it not as something that happened to me, but as something my consciousness created in response to what happened to me.\n\nThis distinction is crucial: Something happened to me puts the locus of control outside myself. The world did this. My parents did this. My past did this. I am a victim of circumstances.\n\nConsciousness created this in response to what happened puts the locus of agency back where it actually is: in the organizing principle of my own awareness. And when agency returns, freedom becomes possible.\n\nChapter Six: The Quantum Nature of Self\n\nHere’s where the inquiry becomes truly fascinating, because it moves from psychology into the physics of consciousness itself.\n\nThere’s a principle in quantum mechanics that begins to illuminate what I was observing in my own consciousness: The observer effect. The principle that the very act of observation changes what is being observed.\n\nAt the quantum level, particles exist in a state of superposition, they have multiple potential states simultaneously. But the moment a measurement is taken, the moment an observation occurs, the superposition collapses into a single state. This isn’t metaphorical. It’s the actual behaviour of matter at the subatomic level.\n\nNow, My sense of self is not unlike a quantum system in superposition. I contain multiple potential selves, multiple ways of being. There is the self that is anxious, the self that is confident, the self that is shameful, the self that is free. These are not separate entities. They are my potential states within consciousness.\n\nAnd the act of observation, of becoming aware, of paying attention to what is actually happening, has the power to collapse that superposition. When I was identified with the belief that I was broken, unworthy, fundamentally deficient, I was collapsing the superposition into that state. I was collapsing the infinite potential of my being into a single, narrow definition.\n\nBut when I began to observe that belief instead of being identical with it, when I could see it as a thought-pattern rather than a truth, something shifted. The superposition didn’t collapse into a different state because I forced it. It collapsed because the observation itself had changed.\n\nI was no longer observing from within the identity. I was observing from outside of it. I was observing from awareness itself. And from that position, the potential states available to consciousness began to shift.\n\nThis is not mystical thinking. This is not wishful thinking. This is a direct parallel to what happens in quantum systems. And it explains something that is often mysterious: why genuine transformation doesn’t come from willpower or effort, but from observation.\n\nWillpower is trying to force a different state. Willpower is saying, I am broken, but I will try very hard to act as if I’m not broken. That creates a conflict. The belief persists, but now there’s a layer of denial on top of it.\n\nObservation is different. Observation is saying, Here is what is actually happening. Here is what I am creating. Here is what is true. And in that honest seeing, the system naturally begins to reorganize itself. The potential states collapse into a different configuration. Not because I commanded it, but because consciousness is observing itself more accurately.\n\nEpilogue: The Inquiry Continues\n\nNow, years into this unfolding, I don’t claim to have arrived at some final endpoint. The patterns continue to reveal themselves. There are layers within layers. The same conditioning shows up in new contexts. The same samskara appears in different forms.\n\nBut the fundamental shift has held. The capacity to observe rather than be identified has become more natural. The trust in the intelligence of my own nature has deepened.\n\nAnd what has become clear through this entire journey is something that seems almost absurdly simple, yet changes everything: You are creating your world. Not through manifestation or willpower, but through the state of consciousness you inhabit. Through the beliefs you carry. Through the lens through which you perceive. Through the nervous system state from which you move.\n\nAnd while it is true that circumstances matter, that conditioning is real, that samskaras have weight, it is also true that consciousness has the capacity to observe itself and, in that observation, to transform.\n\nThe world that seems to be happening to you is actually being created by you, through the invisible architecture of your beliefs and patterns. And the extraordinary possibility is this: If you were creating this world, then you have the capacity to create a different one.\n\nNot through striving or forcing. But through the simple, radical act of seeing: seeing your patterns, seeing your beliefs, seeing how you are constructing reality moment by moment.\n\nAnd in that seeing, freedom becomes not a distant ideal, but a present possibility. This is the essence of what I have learned. This is what the inquiry has revealed. And it is available to anyone willing to look."}